
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на общий модуль по источнику события.
//
// Параметры:
//  Источник - ДокументОбъект, СправочникОбъект - Источник события.
//
// Возвращаемое значение:
//  ОбщийМодуль, Неопределено - Общий модуль.
//
Функция ОбщийМодульОбъекта(Источник) Экспорт
	
	ИмяОбъекта = Источник.Метаданные().ПолноеИмя();

	Модуль = ОбщийМодульПереопределяемогоОбъекта(ИмяОбъекта);
	
	Возврат Модуль;

КонецФункции
 
// Возвращает существование общего модуля по имени.
//
// Параметры:
//  ИмяМодуля - Строка - Имя общего модуля.
//
// Возвращаемое значение:
//  Булево - Истина, если общий модуль существует.
//
Функция ОбщийМодульСуществует(ИмяМодуля) Экспорт
	
	Возврат мк_ОбщегоНазначенияПовтИсп.ОбщийМодульСуществует(ИмяМодуля);

КонецФункции

// Возвращает ссылку на общий модуль по имени объекта.
//
// Параметры:
//  ИмяОбъекта - Строка - Имя объекта.
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль.
//
Функция ОбщийМодульПереопределяемогоОбъекта(ИмяОбъекта) Экспорт

	Возврат мк_ОбщегоНазначенияПовтИсп.ОбщийМодульПереопределяемогоОбъекта(ИмяОбъекта);

КонецФункции

// Возвращает общий префикс имен объектов конфигурации.
// 
// Возвращаемое значение:
//  Строка - Префикс имен конфигурации.
//
Функция ПрефиксИмен() Экспорт

	Возврат "мк_";

КонецФункции

#КонецОбласти
