
#Область ПрограммныйИнтерфейс

// Возвращает существование общего модуля по имени.
//
// Параметры:
//  Имя - Строка - Имя общего модуля.
//
// Возвращаемое значение:
//  Булево - Истина, если общий модуль существует.
//
Функция ОбщийМодульСуществует(Имя) Экспорт

	Возврат мк_ОбщегоНазначения.ОбщийМодульСуществует(Имя);

КонецФункции

// Возвращает общий префикс имен объектов конфигурации.
// 
// Возвращаемое значение:
//  Строка - Префикс имен конфигурации.
//
Функция ПрефиксИмен() Экспорт

	Возврат мк_ОбщегоНазначения.ПрефиксИмен();

КонецФункции

#КонецОбласти
