
#Область ПрограммныйИнтерфейс

&После("ПриСозданииНаСервере")
Процедура мк_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	мк_СобытияФорм.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&После("ПриЧтенииНаСервере")
Процедура мк_ПриЧтенииНаСервере(Форма, ТекущийОбъект)
	
	мк_СобытияФорм.ПриЧтенииНаСервере(Форма, ТекущийОбъект);

КонецПроцедуры

&После("ПередЗаписьюНаСервере")
Процедура мк_ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи)

	мк_СобытияФорм.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&После("ПослеЗаписиНаСервере")
Процедура мк_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи)

	мк_СобытияФорм.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры
  
#КонецОбласти