#Область ПрограммныйИнтерфейс

// Инициализирует набор параметров, задающих флаги выполнения обработчиков.
//
// Параметры:
//  ПараметрыОбработчиков	 - Структура - Параметры обработчиков.
//
//
Процедура ОпределитьПараметрыОбработчиков(ПараметрыОбработчиков) Экспорт
	
	ПараметрыОбработчиков.Вставить("ПриСозданииНаСервере", Истина);

КонецПроцедуры

// Вызывается в обработчике одноименного события формы объекта.
//	Вызывается через модуль "гк_СобытияФорм".
//	См. "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма объекта.
//	Отказ - Булево - Признак отказа от выполнения обработчика.
//	СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти